//PDCAFIN2 JOB CLASS=M,MSGCLASS=X,MSGLEVEL=(1,1),REGION=6M
//***     RESTART=PDCAFIN2.COPYVAR
//OUTDEF   OUTPUT DEFAULT=Y,FORMLEN=11IN
//*
//OUTINF   OUTPUT CLASS=*,FORMLEN=11IN
//OUTCPA   OUTPUT CLASS=F,FORMLEN=11IN,
//         NAME='RAG. ROSI (CPA) BANCO NAPOLI 1� B.'
//******************************************************************
//* ACQUISIZIONI DATI DAL CAF DELLA CAMERA E DAI CAAF ESTERNI
//* CREAZIONE SKEDE VARIAZIONI PER RIMBORSI/TRATTENUTE IRPEF/CSSN
//******************************************************************
//*   4181  :  SALDO  CSSN A DEBITO(SOLO PER 1997)
//*   4182  :  SALDO  CSSN A CREDITO (SOLO PER 1997)
//*   4183  :  SALDO IRPEF A DEBITO (RATEIZZABILE) - BASE
//*   4237  :  SALDO IRPEF A DEBITO (RATEIZZABILE) - RIMBORSI
//*   4184  :  SALDO IRPEF A CREDITO
//*   4185  :  PRIMO ACCONTO IRPEF
//*   4186  :  SECONDO ACCONTO IRPEF
//*   4198  :  SECONDO ACCONTO IRPEF - RIMBORSI
//*   4187  :  ACCONTO SULLA TASSAZIONE SEPARATA
//*   4188  :  INTERESSI PAG. RATEALE  SALDO CSSN
//*   4189  :  INTERESSI PAG. RATEALE  SALDO IRPEF
//*   4190  :  INTERESSI PAG. RATEALE  PRIMO ACCONTO IRPEF
//*   4191  :  INTERESSI PAG. RATEALE  ACCONTO TASS. SEPARATA
//*   4206  :  ADDIZ. REGIONALE A DEBITO
//*   4207  :  ADDIZ. REGIONALE A CREDITO
//*   4208  :  INTERESSI SU ADDIZ. REGIONALE A DEBITO
//*   4209  :  ADDIZ. REGIONALE A DEBITO  (CONIUGE)
//*   4210  :  ADDIZ. REGIONALE A CREDITO (CONIUGE)
//*   4211  :  INTERESSI SU ADDIZ. REGIONALE(CONIUGE)  A DEBITO
//*   4212  :  ACCONTO 20% TASSAZ. SEPARATA (CONIUGE)
//*   4213  :  INTERESS ACCONTO 20% TASSAZ. SEPARATA (CONIUGE)
//********************************************************************
//*
//PDCAFIN2 PROC
//*-----------------------------------------------------------------
//SCARCAF  EXEC PGM=IDCAMS
//INPUT    DD DSN=TEPDET.CXCB2S.PDKCAF,DISP=SHR
//OUTPUT   DD DSN=&&CAFSEQ,DISP=(,PASS),SPACE=(CYL,(2,1)),UNIT=3390,
//            DCB=(RECFM=FB,LRECL=600,DSORG=PS)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DSN=TEPE1A.TSO.PARM(PTVSREPR),DISP=SHR
//*-------------------------------------------------------------------
//SCRA     EXEC PGM=IEFBR14
//PDKCAF   DD DSN=TEPDET.BPDKCAF.PDCAF002.M&MENS.T&TIPO,
//            SPACE=(TRK,1),DISP=(MOD,DELETE)
//VARIAZ   DD DSN=TEPDET.BVARIAZ.CAF&ANNO..M&MENS.T&TIPO,
//            SPACE=(TRK,1),DISP=(MOD,DELETE)
//VOCI730  DD DSN=TEPDET.BVOCI.CAF&ANNO..M&MENS.T&TIPO,
//            SPACE=(TRK,1),DISP=(MOD,DELETE)
//*----------------------------------------------------------------
//PDHM730B EXEC PGM=PDHM730B,PARM='&ANNORIF,&TIPO,&ANNO.&MENS.0'
//*STEPLIB  DD DSN=SISY2S.BATCHAM.LOADLIB,DISP=SHR
//***MIGR PDKANAG0 DD DSN=TEPDET.CXCB2S.SPAL,DISP=SHR
//INPCAF   DD DSN=&&CAFSEQ,DISP=(OLD,DELETE)
//***MIGR PDKTAB1  DD DSN=TEPDET.CXCB2S.PDKTAB1,DISP=SHR
//***MIGR PDKIPC0  DD DSN=TEPDET.CXCB2S.IPCONT,DISP=SHR
//***MIGR PDKAVC0  DD DSN=TEPDET.CXCB2S.AVCONT,DISP=SHR
//OUTCAF   DD DSN=TEPDET.BPDKCAF.PDCAF002.M&MENS.T&TIPO,
//            VOL=SER=TESP2A,SPACE=(CYL,(8,1),RLSE),UNIT=3390,
//            DCB=(RECFM=FB,LRECL=600,DSORG=PS),DISP=(,CATLG,DELETE)
//SKVAR1   DD DSN=TEPDET.BVARIAZ.CAF&ANNO..M&MENS.T&TIPO,
//            VOL=SER=TESP2A,UNIT=3390,SPACE=(CYL,(1,1)),
//            DCB=(RECFM=FB,LRECL=80,DSORG=PS),DISP=(,CATLG,DELETE)
//SKVAR2   DD DSN=&&SKVAR2,DISP=(,PASS),UNIT=3390,SPACE=(CYL,(1,1)),
//            DCB=(RECFM=FB,LRECL=80,DSORG=PS)
//FILESTA  DD DSN=&&FILESTA,DISP=(,PASS),UNIT=3390,SPACE=(CYL,(1,1)),
//            DCB=(RECFM=FB,LRECL=660,DSORG=PS)
//FILEST2  DD DSN=&&FILEST2,DISP=(,PASS),UNIT=3390,SPACE=(CYL,(1,1)),
//            DCB=(RECFM=FB,LRECL=154,DSORG=PS)
//STAATT   DD DUMMY
//STACESS  DD DUMMY
//*SYSOUT   DD SYSOUT=*
//SYSOUT   DD SYSOUT=(,),OUTPUT=(*.OUTCPA,*.OUTINF)
//SYSUDUMP DD SYSOUT=9
//*-------------------------------------------------------------------
//PDHM730C EXEC PGM=PDHM730C,
//         PARM='&TIPO,  ,        ,                    '
//*STEPLIB  DD DSN=SISY2S.BATCHAM.LOADLIB,DISP=SHR
//***MIGR TIPVS    DD DSN=TEPDET.CXCB2S.TIP,DISP=SHR
//***MIGR PDKVCIP  DD DSN=TEPDET.CXCB2S.PDKVCIP,DISP=SHR
//***MIGR PDKVCAV  DD DSN=TEPDET.CXCB2S.PDKVCAV,DISP=SHR
//SKINPUT  DD DSN=TEPDET.BVARIAZ.CAF&ANNO..M&MENS.T&TIPO,DISP=SHR
//FOUTPUT  DD DSN=TEPDET.BVOCI.CAF&ANNO..M&MENS.T&TIPO,
//            UNIT=3390,SPACE=(CYL,(1,1)),DISP=(,CATLG),VOL=SER=TESP2A,
//            DCB=(DSORG=PS,LRECL=200,RECFM=FB)
//STAMPA   DD SYSOUT=(,),OUTPUT=(*.OUTCPA,*.OUTINF),
//            DCB=(RECFM=FA,LRECL=133)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=9
//*-------------------------------------------------------------------
//SKSANAG  EXEC PGM=PARM2SK,
//         PARM=' SORT FIELDS=(400,60,CH,A)'
//*STEPLIB  DD DSN=SISY2S.BATCHAM.LOADLIB,DISP=SHR
//SKEDA    DD DSN=&&SKANAG,DISP=(,PASS),UNIT=3390,SPACE=(80,1)
//SYSOUT   DD DUMMY
//*-----------------------------------------------------------------
//SORANAG  EXEC PGM=ICEMAN
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SORTIN   DD DSN=&&FILESTA,DISP=(OLD,DELETE)
//SORTOUT  DD DSN=&&ANAGS,DISP=(,PASS),UNIT=3390,SPACE=(CYL,(1,1))
//SYSOUT   DD SYSOUT=*
//SYSIN    DD DSN=&&SKANAG,DISP=(OLD,DELETE)
//*-------------------------------------------------------------------
//PDHM730D EXEC PGM=PDHM730D,
//         PARM='&ANNORIF,T,&TIPO,&ANNO&MENS'
//*        PARM='&ANNORIF,T,&TIPO,TTTTTTT'
//*  PDHMFS56: PARM='ANNO,TIPO-ELAB,SESSIONE'
//*  ANNO   = ANNO CUI SI RIFERISCE LA DICHIARAZIONE A SALDO
//*  TIPO INVIO: '0' CAF CAMERA; '1' CAAF ESTERNI; 'T' TUTTI
//*  TIPO DIP. : '5D' DEP.     ; '67' EX + VED.  ; 'TT' TUTTI
//*  SESSIONE= SESSIONE DI LIQUIDAZIONE  /TTTTTTT
//*STEPLIB  DD DSN=SISY2S.BATCHAM.LOADLIB,DISP=SHR
//INPCAF   DD DSN=&&ANAGS,DISP=(OLD,PASS)
//***MIGR PDKANAG0 DD DSN=TEPDET.CXCB2S.SPAL,DISP=SHR
//***MIGR PDKTAB1  DD DSN=TEPDET.CXCB2S.PDKTAB1,DISP=SHR
//***MIGR PDKALQC  DD DSN=TEPDET.CXCB2S.PDKALQC,DISP=SHR
//STAMPA   DD SYSOUT=(,),OUTPUT=(*.OUTCPA,*.OUTINF),
//            DCB=(RECFM=FA,LRECL=151)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=9
//*-------------------------------------------------------------------
//M730D2   EXEC PGM=PDHM730D,
//         PARM='&ANNORIF,T,AT,TTTTTTT'      *** CESSATI ***
//*  PDHMFS56: PARM='ANNO,TIPO-ELAB,SESSIONE'
//*  ANNO   = ANNO CUI SI RIFERISCE LA DICHIARAZIONE A SALDO
//*  TIPO INVIO: '0' CAF CAMERA; '1' CAAF ESTERNI; 'T' TUTTI
//*  TIPO DIP. : '5D' DEP.     ; '67' EX + VED.  ; 'TT' TUTTI
//*  SESSIONE= SESSIONE DI LIQUIDAZIONE  /TTTTTTT
//*STEPLIB  DD DSN=SISY2S.BATCHAM.LOADLIB,DISP=SHR
//INPCAF   DD DSN=&&ANAGS,DISP=(OLD,DELETE)
//***MIGR PDKANAG0 DD DSN=TEPDET.CXCB2S.SPAL,DISP=SHR
//***MIGR PDKTAB1  DD DSN=TEPDET.CXCB2S.PDKTAB1,DISP=SHR
//***MIGR PDKALQC  DD DSN=TEPDET.CXCB2S.PDKALQC,DISP=SHR
//STAMPA   DD SYSOUT=(,),OUTPUT=(*.OUTCPA,*.OUTINF),
//            DCB=(RECFM=FA,LRECL=151)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=9
//*-------------------------------------------------------------------
//COPYVAR     EXEC  PGM=IEBGENER                          
//SYSPRINT DD  SYSOUT=*                                
//SYSUT1 DD DSN=TEPDET.BVARIAZ.CAF&ANNO..M&MENS.T&TIPO,DISP=OLD        
//SYSUT2 DD DSN=TEPDET.BVARIAZ.CAF.T&TIPO,DISP=OLD,
//         DCB=(*.SYSUT1) 
//*
//*-------------------------------------------------------------------
//*  PROCEDURA PER SOLO INTEGRATIVI DI TIPO 1
//*-------------------------------------------------------------------
//PDCAFIN2 PEND
//*
//PDCAFIN2 EXEC PDCAFIN2,
//     ANNORIF=2023,      ** ANNO DI RIFERIMENTO REDDITI
//     ANNO=2024,         ** ANNO DI ELABORAZIONE
//     TIPO=67,           ** DEPUTATI: 5D ; EX+VED: 67
//     MENS=12            ** MESE DELLA LIQUIDAZIONE LASCIARE SEMPRE 12
//*
//*-----------------------------------------------------------------
//* modificato PDCAFIN2.JCL  


